---
type: IMultiServerService
namespace: Autodesk.Revit.DB.ExternalService
version: 2024
members: 1
tags: [revit-api, class]
---

# IMultiServerService

`Autodesk.Revit.DB.ExternalService.IMultiServerService` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CanExecute | 2013 | `bool CanExecute ( IExternalServer server , Document document , IExternalData data )` |